Revit API Introduction Labs
Lab4_1_ElementParameters Class
 List all parameters for selected elements.
This lab explores the parameters attached to every Revit element.
 Add a new module
CopyC#
Labs4
 to the project and the first command class
CopyC#
Lab4_1_ParametersForSelectedObjects
 for this lab. Since we will be exporting parameter values to Excel later on in this lab, the C# code includes a statement to use that namespace as well. For the moment we just loop through all elements in the current selection set, iterate over their parameter collection, and display the names, types and values of each paramter:
 Compile, load and run the command. Look at the elements and their properties in the debugger, especially the
CopyC#
Parameters
 property.
 Add code within the loop to report all UI-visible parameters for each element.
CopyC#
foreach( Parameter p in e2.Parameters )
{
  string name = p.Definition.Name;
  string type = p.StorageType.ToString();
  string value = LabUtils.GetParameterValue2( p, uidoc.Document );
  a.Add( string.Format(
    "Name={0}; Type={1}; Value={2}; ValueString={3}",
    name, type, value, p.AsValueString() ) );
}
CopyVB.NET
For Each p As Parameter In e2.Parameters
    Dim name As String = p.Definition.Name
    Dim type As String = p.StorageType.ToString()
    Dim value As String = LabUtils.GetParameterValue2(p, uidoc.Document)
    a.Add("Name=" + name + "; Type=" + type + "; Value=" + value _
          + "; ValueString=" + p.AsValueString())
Next
 At this point you can compile and link the project again and see the list of element properties reported for selected elements.
 There are several different methods to access a specific parameter: by localised name, by built-in parameter enum, by definition or by GUID.
CopyC#
Parameter p = e.get_Parameter(
  BuiltInParameter.FAMILY_BASE_LEVEL_OFFSET_PARAM );
CopyVB.NET
parBuiltIn = e.Parameter(BuiltInParameter.FAMILY_BASE_LEVEL_OFFSET_PARAM)
 Compile, load and launch the command, selecting various elements first. Note that built-in parameters are available for some, but not all categories. For instance, try Walls, Columns and Furniture. The
CopyC#
BuiltInParameter.FAMILY_BASE_LEVEL_OFFSET_PARAM
 and 'Base Offset' parameters used in the sample are available on column elements.
 Note that more parameters may be available on any given element than those reported by the element's
CopyC#
Parameters
 property ... use the
CopyC#
BuiltInParamsChecker
 to discover these as well.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab4_1_ElementParameters : IExternalCommand
Visual Basic (Declaration)
Public Class Lab4_1_ElementParameters _
	Implements IExternalCommand
Visual C++
public ref class Lab4_1_ElementParameters : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab4_1_ElementParameters
See Also
Lab4_1_ElementParameters Members
Labs Namespace